Catalogs/User.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>User</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Manager</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserID</Name>
					<Comment>Требуется для сопоставления элемента справочника ВнешниеПользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserName</Name>
					<Comment>Для логина выполняется проверка на уникальность в пределах всего справочника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Role</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Position</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Positions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InterfaceLanguage</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoleOfUser</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RolesOfUsers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/User/Ext/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	
	If Not Cancel Then 
		
		If Lower(UserName) = "demo" Then
			
			Password = "demo";
			
		EndIf;
		
		If Lower(UserName) = "demoaccess" Then
			
			Password = "password";
			
		EndIf;
		
		If Not ValueIsFilled(RoleOfUser) Then 
			
			Role = "Admin";
			
		EndIf;
		
		If Not Role = "Admin" Then 
			
			Role = "SR";
			
			If RoleOfUser.Role = "Unknown" Then 
				
				Role = "Unknown";
				
			ElsIf RoleOfUser.Role = "SRM" Then
				
				Role = "SRM";
				
			EndIf;
			
			// Создать пользователя и установить UserID
			ParametersStructure = New Structure();
			ParametersStructure.Insert("FullName", Description);
			ParametersStructure.Insert("UserName", UserName);
			ParametersStructure.Insert("UserID", UserID);
			ParametersStructure.Insert("Role", Role);
			SetPrivilegedMode(True);
			If Not(InfoBaseUsers.FindByUUID(Новый УникальныйИдентификатор(UserID))=Undefined) Then
				If InfoBaseUsers.FindByUUID(Новый УникальныйИдентификатор(UserID)).CannotChangePassword=False Then
					ParametersStructure.Insert("Password", Password);
				EndIf;
				ParametersStructure.Insert("CanNotChangePass", InfoBaseUsers.FindByUUID(Новый УникальныйИдентификатор(UserID)).CannotChangePassword);
			Else
				ParametersStructure.Insert("Password", Password);
			EndIf;
			ParametersStructure.Insert("InterfaceLanguage", InterfaceLanguage);
			UserID = Users.CreateUser(ParametersStructure);
			SetPrivilegedMode(False);
		EndIf;
		
	EndIf;
	
EndProcedure

Procedure SendMessage() Export
	
	If TrimAll(EMail) = "" Then
		
		Return;
		
	EndIf;
		
	Recepients = New Array;
	Recepients.Add(EMail);
	
	Theme = NStr("ru = 'Данные для доступа в мобильное приложение БИТ.СуперАгент'");
	
	Body = "Имя пользователя: " + UserName + Chars.CR + "Пароль: " + Password;
	
	Message = DataProcessors.bitmobile_СинхронизацияИНастройки.ПолучитьПочтовоеСообщение(Recepients, Theme, Body);
	
	DataProcessors.bitmobile_СинхронизацияИНастройки.ОтправитьСообщение(Message);
	
EndProcedure

Procedure OnCopy(CopiedObject)
	a=1;
EndProcedure
